pengchujin/esp8266-ai/firmware/src/main.cpp
  float seg = min(remaining, (float)side);
  tft.fillRect(x0, y0, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, (int)seg, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - (int)seg, y1 - RING_THICKNESS, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x0, y1 - (int)seg, RING_THICKNESS, (int)seg, color);
}

void drawClaudeSprite(int frameIdx) {
  drawSpriteFrame(claudeCustom, CLAUDE_SPRITE_FILE, claude_sprite_frames, frameIdx, CLAUDE_SPRITE_W,
                  CLAUDE_SPRITE_H, CLAUDE_FRAME_BYTES);
}

void drawCodexSprite(int frameIdx) {
  drawSpriteFrame(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, frameIdx, CODEX_SPRITE_W, CODEX_SPRITE_H,
                  CODEX_FRAME_BYTES);
}

void drawKimiSprite(int frameIdx) {
  drawSpriteFrame(kimiCustom, KIMI_SPRITE_FILE, kimi_sprite_frames, frameIdx, KIMI_SPRITE_W,
                  KIMI_SPRITE_H, KIMI_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// Two quota lines below the sprite: hourly (5h) window and weekly window.
void drawQuotaText(float hourPct, float weekPct) {
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("5h " + pctText(hourPct), SCREEN_CX, 190, 2);
  tft.drawString("Weekly " + pctText(weekPct), SCREEN_CX, 208, 2);
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  const uint16_t *logo;
  int w, h;
  if (currentApp == APP_CLAUDE) {
    logo = claude_logo_0;
    w = CLAUDE_LOGO_W;
    h = CLAUDE_LOGO_H;
  } else if (currentApp == APP_CODEX) {
    logo = codex_logo_0;
    w = CODEX_LOGO_W;
    h = CODEX_LOGO_H;
  } else {
    logo = kimi_logo_0;
    w = KIMI_LOGO_W;
    h = KIMI_LOGO_H;
  }
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Redraws whichever app is currently active, full screen: quota ring + sprite.
void drawActiveApp() {
  tft.fillScreen(TFT_BLACK);
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    drawClaudeSprite(claudeFrame);
    drawQuotaText(claudeRingPct(), claudeStatus.sevenDayPct);
  } else if (currentApp == APP_CODEX) {
    drawSquareRing(max(codexStatus.primaryPct, 0.0f), currentStatusColor());
    drawCodexSprite(codexFrame);
    drawQuotaText(codexStatus.primaryPct, codexStatus.weeklyPct);
  } else {
    drawSquareRing(max(kimiStatus.fiveHourPct, 0.0f), currentStatusColor());
    drawKimiSprite(kimiFrame);
    drawQuotaText(kimiStatus.fiveHourPct, kimiStatus.sevenDayPct);
  }
  drawAppLogo();
}

// Redraws just the ring (cheap) - used for status color animation ticks
// between full redraws.
void redrawRingOnly() {
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
  } else if (currentApp == APP_CODEX) {
    drawSquareRing(max(codexStatus.primaryPct, 0.0f), currentStatusColor());
  } else {
    drawSquareRing(max(kimiStatus.fiveHourPct, 0.0f), currentStatusColor());
  }
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - both working                  -> alternate every SWITCH_BOTH_MS (2s)
//   - neither working               -> alternate slowly (SWITCH_IDLE_MS)
static ActiveApp nextAppInCycle(ActiveApp app) {
  return (app == APP_CLAUDE) ? APP_CODEX : (app == APP_CODEX) ? APP_KIMI : APP_CLAUDE;
}

bool updateActiveApp() {
  ActiveApp desired = currentApp;

  if (displayMode == MODE_CLAUDE) {
    desired = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    desired = APP_CODEX;
  } else if (displayMode == MODE_KIMI) {
    desired = APP_KIMI;
  } else {
    // approval prompt: exactly one app waiting for input wins the screen
    int inputCount = 0;
    if (claudeStatus.needsInput) inputCount++;
    if (codexStatus.needsInput) inputCount++;
    if (kimiStatus.needsInput) inputCount++;
    if (inputCount == 1) {
      if (claudeStatus.needsInput) desired = APP_CLAUDE;
      else if (codexStatus.needsInput) desired = APP_CODEX;
      else desired = APP_KIMI;
    } else {
      bool claudeWorking = claudeStatus.status == "working";
      bool codexWorking = codexStatus.status == "working";
      bool kimiWorking = kimiStatus.status == "working";
      int workingCount = (claudeWorking ? 1 : 0) + (codexWorking ? 1 : 0) + (kimiWorking ? 1 : 0);

      if (workingCount == 1) {
        if (claudeWorking) desired = APP_CLAUDE;
        else if (codexWorking) desired = APP_CODEX;
        else desired = APP_KIMI;
      } else {
        unsigned long interval = (workingCount > 1) ? SWITCH_BOTH_MS : SWITCH_IDLE_MS;
        if (millis() - lastSwitchMs >= interval) {
          lastSwitchMs = millis();
          // rotate through the relevant set until we land on a member
          ActiveApp nextApp = nextAppInCycle(currentApp);
          if (workingCount > 1) {
            while ((nextApp == APP_CLAUDE && !claudeWorking) ||
                   (nextApp == APP_CODEX && !codexWorking) ||
                   (nextApp == APP_KIMI && !kimiWorking)) {
              nextApp = nextAppInCycle(nextApp);
            }
          }
          desired = nextApp;
        }
      }
    }
  }

